emacs/init.org
#+TITLE: Jawad's Emacs Config
#+AUTHOR: Jawad Ahmed (@jawadcode)
#+DESCRIPTION: My personal emacs configuration.
#+STARTUP: showeverything
#+OPTIONS: toc:2
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes

# TODO:
# * Proof-General for Coq, I may test Coq out on windows considering
#   that i have the DKML OCaml toolchain working.

* Table of Contents :toc:
- [[#prelude][Prelude]]
  - [[#initel-header][~init.el~ header]]
  - [[#inhibit-startup-message][Inhibit Startup Message]]
  - [[#set-font][Set Font]]
  - [[#disable-scroll-bar][Disable Scroll Bar]]
  - [[#zooming-inout][Zooming In/Out]]
  - [[#indentation][Indentation]]
  - [[#linux-specific-macro][Linux-Specific Macro]]
- [[#straightel-setup][Straight.el Setup]]
  - [[#bootstrap-straight][Bootstrap Straight]]
  - [[#locations][Locations]]
  - [[#delight][Delight]]
  - [[#general-keybinds][General Keybinds]]
- [[#misc-setup][Misc Setup]]
  - [[#display-line-numbers-and-enable-soft-wrap][Display Line Numbers and Enable Soft-Wrap]]
  - [[#garbage-collector-magic-hack][Garbage Collector Magic Hack]]
  - [[#create-general-keybinds-definer][Create General Keybinds Definer]]
  - [[#miscellaneous-keybinds][Miscellaneous Keybinds]]
- [[#editor][Editor]]
  - [[#electric-pair-mode][Electric-Pair-Mode]]
  - [[#evil-mode][Evil Mode]]
  - [[#which-key][Which-Key]]
  - [[#projectile][Projectile]]
  - [[#polymode][Polymode]]
- [[#programs][Programs]]
  - [[#dashboard][Dashboard]]
  - [[#treemacs][Treemacs]]
  - [[#pdf-tools][PDF-Tools]]
- [[#appearance][Appearance]]
  - [[#all-the-icons][All The Icons]]
  - [[#ligatures][Ligatures]]
  - [[#solaire-mode][Solaire-Mode]]
  - [[#enable-divider-for-resizing-windows][Enable Divider for Resizing Windows]]
  - [[#standard-themes-standard-light][Standard-Themes (Standard-Light)]]
  - [[#centaur-tabs][Centaur Tabs]]
  - [[#tree-sitter][Tree-Sitter]]
- [[#org-mode][Org-Mode]]
  - [[#disable-org-indent-mode][Disable Org-Indent-Mode]]
  - [[#org-keybinds][Org Keybinds]]
  - [[#enabling-table-of-contents][Enabling Table of Contents]]
  - [[#enable-org-bullets][Enable Org Bullets]]
  - [[#enable-org-tempo-expansions][Enable Org Tempo Expansions]]
- [[#completion][Completion]]
  - [[#ivy--counsel][Ivy & Counsel]]
  - [[#company][Company]]
  - [[#yasnippet][Yasnippet]]
- [[#language-support][Language Support]]
  - [[#lsp-mode][LSP-Mode]]
  - [[#c-mode--c-mode][C-Mode && C++-Mode]]
  - [[#rust-mode][Rust-Mode]]
  - [[#python-mode][Python-Mode]]
  - [[#haskell-mode][Haskell-Mode]]
  - [[#lean4-mode][Lean4-Mode]]
  - [[#idris2-mode][Idris2-Mode]]
  - [[#meson-mode][Meson-Mode]]
  - [[#cmake-mode][CMake-Mode]]
  - [[#nix-mode][Nix-Mode]]
  - [[#typescript-mode][Typescript-Mode]]
  - [[#svelte-mode][Svelte-Mode]]
  - [[#latex-mode-auctex][LaTeX-Mode (AUCTeX)]]

* Prelude

The following configurations set the scene for the tragedy that is my emacs
configuration.
  
** ~init.el~ header

#+begin_src emacs-lisp
  ;;; init.el --- Personal configuration -*- lexical-binding: t -*-
#+end_src

** Inhibit Startup Message

#+begin_src emacs-lisp
  (setq inhibit-startup-message t
        inhibit-startup-echo-area-message t)
#+end_src

** Set Font

#+begin_src emacs-lisp
  (set-face-font 'default
          (font-spec :family "Iosevka Term SS07"
              :size 13.5
              :weight 'normal
              :width 'normal
              :slant 'normal))
  (set-face-font 'fixed-pitch
          (font-spec :family "Iosevka Term SS07"
              :size 13.5
              :weight 'normal
              :width 'normal
              :slant 'normal))
  (set-face-font 'variable-pitch
          (font-spec :family "Roboto"
              :size 13.5
              :weight 'normal
              :width 'normal))
  (set-fontset-font t
          'emoji
          (font-spec :family "Noto Color Emoji"
                :size 13.5
                :weight 'normal
                :width 'normal
                :slant 'normal))
#+end_src

** Disable Scroll Bar

#+begin_src emacs-lisp
  (scroll-bar-mode -1)
#+end_src

** Zooming In/Out

Enable Ctrl +/- and Ctrl mouse-wheel-(up|down) keybinds.

#+begin_src emacs-lisp
  (keymap-global-set "C-+"            #'text-scale-increase)
  (keymap-global-set "C--"            #'text-scale-decrease)
  (keymap-global-set "C-<wheel-up>"   #'text-scale-increase)
  (keymap-global-set "C-<wheel-down>" #'text-scale-decrease)
#+end_src

** Indentation

The mantra of the emacs user: undoing dumb defaults.

#+begin_src emacs-lisp
  (indent-tabs-mode -1)
  (setq-default tab-width 4)
  (setq-default evil-shift-width 4)
#+end_src

** Linux-Specific Macro

A few aspects of this config are regrettably platform-specific, particularly
linux-specific.

#+begin_src emacs-lisp
  (defmacro linux-specific! (body)
    (pcase system-type
       ('gnu/linux body)
       (_ ())))
#+end_src

* Straight.el Setup

** Bootstrap Straight

#+begin_src emacs-lisp
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name
          "straight/repos/straight.el/bootstrap.el"
          (or (bound-and-true-p straight-base-dir)
              user-emacs-directory)))
        (bootstrap-version 7))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  (straight-use-package 'use-package)
  (setq straight-use-package-by-default t)
#+end_src

** Locations

#+begin_src emacs-lisp
  (use-package f)

  (setq default-directory (f-slash (getenv "HOME")))
  (setq backup-directory-alist `((".*" . ,temporary-file-directory)))
  (setq custom-file (f-join user-emacs-directory "custom.el"))
#+end_src

** Delight

Delight allows us alter the apperance of modes in the modeline. This needs to be
loaded in advance as it adds a ~:delight~ keyword to ~use-package~ invocations.

#+begin_src emacs-lisp
  (use-package delight
    :config
    (delight '((eldoc-mode nil "eldoc")
               (abbrev-mode nil "abbrev")
               (flycheck-mode nil "flycheck"))))
#+end_src

** General Keybinds

The general package allows us to define keybinds and provide descriptions for
each of them to the which-key package. This needs to be loaded in advance as
each of the following packages will depend on it.

#+begin_src emacs-lisp
  (use-package general :config (general-evil-setup))
#+end_src

* Misc Setup

** Display Line Numbers and Enable Soft-Wrap

#+begin_src emacs-lisp
  (add-hook 'text-mode-hook #'display-line-numbers-mode)
  (add-hook 'prog-mode-hook #'display-line-numbers-mode)
  (global-visual-line-mode t)
  (use-package emacs
    :delight (visual-line-mode))
#+end_src

** Garbage Collector Magic Hack

This modifies the emacs lisp garbage collector to improve performance of lsp-mode
and other emacs packages.

#+begin_src emacs-lisp
  (use-package gcmh
    :custom
    ;; From doom emacs' early-init.el
    (gcmh-idle-delay 'auto) ; default is 15s
    (gcmh-auto-idle-delay-factor 10)
    (gcmh-high-cons-threshold (* 16 1024 1024)) ; 16mb
    :config (gcmh-mode 1)
    :delight)
#+end_src

** Create General Keybinds Definer

#+begin_src emacs-lisp
  (general-create-definer jawadcode/leader-keys
    :states '(normal insert visual emacs)
    :keymaps 'override
    :prefix "SPC"
    :global-prefix "M-SPC")
#+end_src

** Miscellaneous Keybinds

#+begin_src emacs-lisp
  (jawadcode/leader-keys
    ;; Buffer keybinds
    "b"   '(:ignore t :wk "Buffer")
    "b k" #'kill-buffer
    ;; File keybinds
    "f"   '(:ignore t :wk "File")
    "f f" #'find-file
    "f r" #'counsel-recentf
    "f c" '((lambda ()
              (interactive)
              (find-file (f-join user-emacs-directory "init.org")))
            :wk "Open emacs config")
    ";"   #'comment-line
    ;; Help keybinds
    "h"   '(:ignore t :wk "Help")
    "h f" #'describe-function
    "h v" #'describe-variable)
#+end_src

* Editor

** Electric-Pair-Mode

I don't use any of the fancy features of the Smartparens package so I thought I
would eliminate some bloat by using the built-in pair completion mode as it is
more than sufficient.

#+begin_src emacs-lisp
  (electric-pair-mode 1)
#+end_src

** Evil Mode

Vim keybinds in emacs because why not.

#+begin_src emacs-lisp
  (use-package evil
    :custom
    (evil-want-integration t)
    (evil-want-keybinding nil)
    (evil-vsplit-window-right t)
    (evil-split-window-below t)
    :config
    (evil-set-undo-system 'undo-redo)
    (evil-mode 1)
    (jawadcode/leader-keys
      "w"   '(:ignore t :wk "Window")
      ;; Window splits
      "w x" '(evil-window-delete :wk "Close window")
      "w n" '(evil-window-new    :wk "New horizontal window")
      "w m" '(evil-window-vnew   :wk "New vertical window")
      "w h" '(evil-window-split  :wk "Horizontal split window")
      "w v" '(evil-window-vsplit :wk "Vertical split window")))

  ;; Extra evil
  (use-package evil-collection
    :after evil
    :custom (evil-collection-mode-list '(dashboard dired ibuffer))
    :config (evil-collection-init)
    :delight evil-collection-unimpaired-mode)

  (use-package evil-anzu :after evil)

  (use-package evil-tutor)
    #+end_src

** Which-Key

Which-key shows a menu of keybinds whenever a key that is the beginning of a
keybind is pressed.

#+begin_src emacs-lisp
  (use-package which-key
    :custom
    (which-key-add-column-padding 3)
    (which-key-idle-delay 0.1)
    :config (which-key-mode 1)
    :delight)
#+end_src

** Projectile

This allows us to manage projects and integrates with lsp-mode as well as
treemacs.

#+begin_src emacs-lisp
  (use-package projectile
    :config
    (projectile-mode 1)
    (jawadcode/leader-keys "p" projectile-command-map)
    :delight '(:eval (concat " " (projectile-project-name))))
#+end_src

** Polymode

Polymode is an implementation of multiple major modes, this allows us to have
language support within codeblocks.

#+begin_src emacs-lisp
  (use-package poly-org)
#+end_src

* Programs

