emacs/init.el
;;; init.el --- Personal configuration -*- lexical-binding: t -*-

(setq inhibit-startup-message t
      inhibit-startup-echo-area-message t)

(set-face-font 'default
        (font-spec :family "Iosevka Term SS07"
            :size 13.5
            :weight 'normal
            :width 'normal
            :slant 'normal))
(set-face-font 'fixed-pitch
        (font-spec :family "Iosevka Term SS07"
            :size 13.5
            :weight 'normal
            :width 'normal
            :slant 'normal))
(set-face-font 'variable-pitch
        (font-spec :family "Roboto"
            :size 13.5
            :weight 'normal
            :width 'normal))
(set-fontset-font t
        'emoji
        (font-spec :family "Noto Color Emoji"
              :size 13.5
              :weight 'normal
              :width 'normal
              :slant 'normal))

(scroll-bar-mode -1)

(keymap-global-set "C-+"            #'text-scale-increase)
(keymap-global-set "C--"            #'text-scale-decrease)
(keymap-global-set "C-<wheel-up>"   #'text-scale-increase)
(keymap-global-set "C-<wheel-down>" #'text-scale-decrease)

(indent-tabs-mode -1)
(setq-default tab-width 4)
(setq-default evil-shift-width 4)

(defmacro linux-specific! (body)
  (pcase system-type
     ('gnu/linux body)
     (_ ())))

(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name
        "straight/repos/straight.el/bootstrap.el"
        (or (bound-and-true-p straight-base-dir)
            user-emacs-directory)))
      (bootstrap-version 7))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(straight-use-package 'use-package)
(setq straight-use-package-by-default t)

(use-package f)

(setq default-directory (f-slash (getenv "HOME")))
(setq backup-directory-alist `((".*" . ,temporary-file-directory)))
(setq custom-file (f-join user-emacs-directory "custom.el"))

(use-package delight
  :config
  (delight '((eldoc-mode nil "eldoc")
             (abbrev-mode nil "abbrev")
             (flycheck-mode nil "flycheck"))))

(use-package general :config (general-evil-setup))

(add-hook 'text-mode-hook #'display-line-numbers-mode)
(add-hook 'prog-mode-hook #'display-line-numbers-mode)
(global-visual-line-mode t)
(use-package emacs
  :delight (visual-line-mode))

(use-package gcmh
  :custom
  ;; From doom emacs' early-init.el
  (gcmh-idle-delay 'auto) ; default is 15s
  (gcmh-auto-idle-delay-factor 10)
  (gcmh-high-cons-threshold (* 16 1024 1024)) ; 16mb
  :config (gcmh-mode 1)
  :delight)

(general-create-definer jawadcode/leader-keys
  :states '(normal insert visual emacs)
  :keymaps 'override
  :prefix "SPC"
  :global-prefix "M-SPC")

(jawadcode/leader-keys
  ;; Buffer keybinds
  "b"   '(:ignore t :wk "Buffer")
  "b k" #'kill-buffer
  ;; File keybinds
  "f"   '(:ignore t :wk "File")
  "f f" #'find-file
  "f r" #'counsel-recentf
  "f c" '((lambda ()
            (interactive)
            (find-file (f-join user-emacs-directory "init.org")))
          :wk "Open emacs config")
  ";"   #'comment-line
  ;; Help keybinds
  "h"   '(:ignore t :wk "Help")
  "h f" #'describe-function
  "h v" #'describe-variable)

(electric-pair-mode 1)

(use-package evil
  :custom
  (evil-want-integration t)
  (evil-want-keybinding nil)
  (evil-vsplit-window-right t)
  (evil-split-window-below t)
  :config
  (evil-set-undo-system 'undo-redo)
  (evil-mode 1)
  (jawadcode/leader-keys
    "w"   '(:ignore t :wk "Window")
    ;; Window splits
    "w x" '(evil-window-delete :wk "Close window")
    "w n" '(evil-window-new    :wk "New horizontal window")
    "w m" '(evil-window-vnew   :wk "New vertical window")
    "w h" '(evil-window-split  :wk "Horizontal split window")
    "w v" '(evil-window-vsplit :wk "Vertical split window")))

;; Extra evil
(use-package evil-collection
  :after evil
  :custom (evil-collection-mode-list '(dashboard dired ibuffer))
  :config (evil-collection-init)
  :delight evil-collection-unimpaired-mode)

(use-package evil-anzu :after evil)

(use-package evil-tutor)

(use-package which-key
  :custom
  (which-key-add-column-padding 3)
  (which-key-idle-delay 0.1)
  :config (which-key-mode 1)
  :delight)

(use-package projectile
  :config
  (projectile-mode 1)
  (jawadcode/leader-keys "p" projectile-command-map)
  :delight '(:eval (concat " " (projectile-project-name))))

(use-package poly-org)
