emacs/init.org
** Dashboard

This package shows a dashboard on startup, getting rid of that hideous default
one. It includes useful links to recent files as well as projects, and most
importantly, it has a better emacs logo.

#+begin_src emacs-lisp
  (use-package dashboard
    :if (< (length command-line-args) 2)
    :after (all-the-icons projectile)
    :init
    (setq initial-buffer-choice 'dashboard-open
          dashboard-startup-banner 'logo
          dashboard-icon-type 'all-the-icons
          dashboard-projects-backend 'projectile
          dashboard-center-content t
          dashboard-set-heading-icons t
          dashboard-set-file-icons t
          dashboard-startupify-list '(dashboard-insert-banner
                                      dashboard-insert-newline
                                      dashboard-insert-banner-title
                                      dashboard-insert-newline
                                      dashboard-insert-navigator
                                      dashboard-insert-newline
                                      dashboard-insert-init-info
                                      dashboard-insert-items)
          dashboard-items '((recents   . 6)
                            (projects  . 6)
                            (bookmarks . 6)))
    :config
    (dashboard-setup-startup-hook))
#+end_src

** Treemacs

This is a file-tree view that can be opened to the left side of any code buffers.

#+begin_src emacs-lisp
  (use-package treemacs-all-the-icons
    :defer t
    :commands treemacs-all-the-icons)

  (use-package treemacs
    :after projectile
    :config
    (treemacs-load-all-the-icons-with-workaround-font "Hermit")
    (treemacs-project-follow-mode t)
    (treemacs-filewatch-mode t)
    (treemacs-git-mode 'deferred)
    :general (jawadcode/leader-keys "r" #'treemacs))

  (use-package treemacs-evil :after (treemacs evil))

  (use-package treemacs-projectile :after (treemacs projectile))

  (use-package treemacs-icons-dired
    :hook (dired-mode . treemacs-icons-dired-enable-once))

  (use-package treemacs-tab-bar :after treemacs)
#+end_src

** PDF-Tools

A PDF viewer.

#+begin_src emacs-lisp
  (linux-specific!
   (use-package pdf-tools
     :mode ("\\.pdf\\'" . pdf-view-mode)
     :config
     (setq-default pdf-view-display-size 'fit-width)
     (setq pdf-view-use-scaling t
           pdf-view-use-imagemagick nil)
     (evil-set-initial-state 'pdf-view-mode 'emacs)
     (add-hook
      'pdf-view-mode-hook
      #'(lambda ()
         (set (make-local-variable 'evil-emacs-state-cursor) (list nil))))))
#+end_src

* Appearance

** All The Icons

Allows for icon support across many packages.

#+begin_src emacs-lisp
  (use-package all-the-icons
    :if (display-graphic-p)
    :config
    (set-fontset-font t 'unicode (font-spec :family "all-the-icons") nil 'append)
    (set-fontset-font t 'unicode (font-spec :family "file-icons") nil 'append)
    (set-fontset-font t 'unicode (font-spec :family "Material Icons") nil 'append)
    (set-fontset-font t 'unicode (font-spec :family "github-octicons") nil 'append)
    (set-fontset-font t 'unicode (font-spec :family "FontAwesome") nil 'append)
    (set-fontset-font t 'unicode (font-spec :family "Weather Icons") nil 'append))
#+end_src

** Ligatures

#+begin_src emacs-lisp
  (use-package ligature
    :config
    ;; Enable all Iosevka ligatures in programming modes
    (ligature-set-ligatures
     'prog-mode
     '("|||>" "<|||" "<==>" "<!--" "####" "~~>" "***" "||=" "||>"
       ":::" "::=" "=:=" "===" "==>" "=!=" "=>>" "=<<" "=/=" "!=="
       "!!." ">=>" ">>=" ">>>" ">>-" ">->" "->>" "-->" "---" "-<<"
       "<~~" "<~>" "<*>" "<||" "<|>" "<$>" "<==" "<=>" "<=<" "<->"
       "<--" "<-<" "<<=" "<<-" "<<<" "<+>" "</>" "###" "#_(" "..<"
       "..." "+++" "/==" "///" "_|_" "www" "&&" "^=" "~~" "~@" "~="
       "~>" "~-" "**" "*>" "*/" "||" "|}" "|]" "|=" "|>" "|-" "{|"
       "[|" "]#" "::" ":=" ":>" ":<" "$>" "==" "=>" "!=" "!!" ">:"
       ">=" ">>" ">-" "-~" "-|" "->" "--" "-<" "<~" "<*" "<|" "<:"
       "<$" "<=" "<>" "<-" "<<" "<+" "</" "#{" "#[" "#:" "#=" "#!"
       "##" "#(" "#?" "#_" "%%" ".=" ".-" ".." ".?" "+>" "++" "?:"
       "?=" "?." "??" ";;" "/*" "/=" "/>" "//" "__" "~~" "(*" "*)"
       "\\\\" "://"))
    ;; Enables ligature checks globally in all buffers. You can also do it
    ;; per mode with `ligature-mode'.
    (global-ligature-mode t))
#+end_src

** Solaire-Mode

Distinguishes code buffers from other buffers. Idk if this is even working but
once again, I can't be bothered checking.

#+begin_src emacs-lisp
  (use-package solaire-mode :config (solaire-global-mode 1))
#+end_src

** Enable Divider for Resizing Windows

#+begin_src emacs-lisp
  (window-divider-mode)
#+end_src

** Standard-Themes (Standard-Light)

#+begin_src emacs-lisp
  (use-package standard-themes
    :custom
    ;; Read the doc string of each of those user options.  These are some
    ;; sample values.
    (standard-themes-bold-constructs t)
    (standard-themes-italic-constructs t)
    (standard-themes-disable-other-themes t)
    (standard-themes-mixed-fonts t)
    (standard-themes-variable-pitch-ui t)
    (standard-themes-prompts '(extrabold italic))
    ;; more complex alist to set weight, height, and optional
    ;; `variable-pitch' per heading level (t is for any level not
    ;; specified):
    (standard-themes-headings
     '((0 . (variable-pitch light 1.8))
       (1 . (variable-pitch light 1.7))
       (2 . (variable-pitch light 1.6))
       (3 . (variable-pitch semilight 1.5))
       (4 . (variable-pitch semilight 1.4))
       (5 . (variable-pitch 1.3))
       (6 . (variable-pitch 1.2))
       (7 . (variable-pitch 1.1))
       (agenda-date . (1.2))
       (agenda-structure . (variable-pitch light 1.7))
       (t . (variable-pitch 1.0))))
    :config (standard-themes-load-light))
#+end_src

** Centaur Tabs

#+begin_src emacs-lisp
  (use-package centaur-tabs
    :after (all-the-icons)
    :custom
    (centaur-tabs-style "bar")
    (centaur-tabs-set-bar 'over)
    (centaur-tabs-cycle-scope 'tabs)
    :config
    (centaur-tabs-group-by-projectile-project)
    (centaur-tabs-change-fonts (face-attribute 'variable-pitch :font) 135)
    (jawadcode/leader-keys
      "t" '(:ignore t :wk "Centaur Tabs")
      "t n" #'centaur-tabs-forward
      "t p" #'centaur-tabs-backward)
    (centaur-tabs-mode t)
    :hook (dashboard-mode . centaur-tabs-local-mode))
#+end_src

** Tree-Sitter

Tree-sitter is a highly performant parser "framework" that can be used for syntax
highlighting. Tree-sitter functionality is actually built into Emacs 29+, however
its a complete pain in the arse to setup and maintain, so I'm resorting to the
tried and true tree-sitter package.

#+begin_src emacs-lisp
  (use-package tree-sitter
    :after tree-sitter-langs
    :config
    (require 'tree-sitter-langs)
    (global-tree-sitter-mode)
    (add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode)
    :delight)

  (use-package tree-sitter-langs)
#+end_src

* Org-Mode

** Disable Org-Indent-Mode

Causes weird indentation issues within (emacs lisp) codeblocks.

#+begin_src emacs-lisp
  (setq org-indent-mode nil)
#+end_src

** Org Keybinds

#+begin_src emacs-lisp
  ;; Org-mode keybinds
  (jawadcode/leader-keys
    "o"   '(:ignore t :wk "Org")
    "o a" #'org-agenda
    "o e" #'org-export-dispatch
    "o i" #'org-toggle-item
    "o t" #'org-todo
    "o T" #'org-todo-list
    "o g" #'org-babel-tangle
    "o d" #'org-time-stamp)

  ;; Org mode table keybinds
  (jawadcode/leader-keys
    "o b"   '(:ignore t :wk "Tables")
    "o b h" #'org-table-insert-hline)
#+end_src

** Enabling Table of Contents

Toc-org automatically generates a table of contents (toc) for org files.

#+begin_src emacs-lisp
  (use-package toc-org
    :commands toc-org-enable
    :hook (org-mode . toc-org-enable))
#+end_src

** Enable Org Bullets

Org-bullets gives us fancy bullet-points with headings and lists in org mode,
as well as indentation under each heading for clarity.

#+begin_src emacs-lisp
  (add-hook 'org-mode-hook 'org-indent-mode)
  (use-package org-bullets
    :hook (org-mode . org-bullets-mode))
#+end_src

** Enable Org Tempo Expansions

Like emmet but for org-mode.
For example, <s expands to a source code block when followed by TAB.

#+begin_src emacs-lisp
  (add-hook 'org-mode-hook #'(lambda () (require 'org-tempo)))
#+end_src

* Completion

