emacs/init.el

(use-package dashboard
  :if (< (length command-line-args) 2)
  :after (all-the-icons projectile)
  :init
  (setq initial-buffer-choice 'dashboard-open
        dashboard-startup-banner 'logo
        dashboard-icon-type 'all-the-icons
        dashboard-projects-backend 'projectile
        dashboard-center-content t
        dashboard-set-heading-icons t
        dashboard-set-file-icons t
        dashboard-startupify-list '(dashboard-insert-banner
                                    dashboard-insert-newline
                                    dashboard-insert-banner-title
                                    dashboard-insert-newline
                                    dashboard-insert-navigator
                                    dashboard-insert-newline
                                    dashboard-insert-init-info
                                    dashboard-insert-items)
        dashboard-items '((recents   . 6)
                          (projects  . 6)
                          (bookmarks . 6)))
  :config
  (dashboard-setup-startup-hook))

(use-package treemacs-all-the-icons
  :defer t
  :commands treemacs-all-the-icons)

(use-package treemacs
  :after projectile
  :config
  (treemacs-load-all-the-icons-with-workaround-font "Hermit")
  (treemacs-project-follow-mode t)
  (treemacs-filewatch-mode t)
  (treemacs-git-mode 'deferred)
  :general (jawadcode/leader-keys "r" #'treemacs))

(use-package treemacs-evil :after (treemacs evil))

(use-package treemacs-projectile :after (treemacs projectile))

(use-package treemacs-icons-dired
  :hook (dired-mode . treemacs-icons-dired-enable-once))

(use-package treemacs-tab-bar :after treemacs)

(linux-specific!
 (use-package pdf-tools
   :mode ("\\.pdf\\'" . pdf-view-mode)
   :config
   (setq-default pdf-view-display-size 'fit-width)
   (setq pdf-view-use-scaling t
         pdf-view-use-imagemagick nil)
   (evil-set-initial-state 'pdf-view-mode 'emacs)
   (add-hook
    'pdf-view-mode-hook
    #'(lambda ()
       (set (make-local-variable 'evil-emacs-state-cursor) (list nil))))))

(use-package all-the-icons
  :if (display-graphic-p)
  :config
  (set-fontset-font t 'unicode (font-spec :family "all-the-icons") nil 'append)
  (set-fontset-font t 'unicode (font-spec :family "file-icons") nil 'append)
  (set-fontset-font t 'unicode (font-spec :family "Material Icons") nil 'append)
  (set-fontset-font t 'unicode (font-spec :family "github-octicons") nil 'append)
  (set-fontset-font t 'unicode (font-spec :family "FontAwesome") nil 'append)
  (set-fontset-font t 'unicode (font-spec :family "Weather Icons") nil 'append))

(use-package ligature
  :config
  ;; Enable all Iosevka ligatures in programming modes
  (ligature-set-ligatures
   'prog-mode
   '("|||>" "<|||" "<==>" "<!--" "####" "~~>" "***" "||=" "||>"
     ":::" "::=" "=:=" "===" "==>" "=!=" "=>>" "=<<" "=/=" "!=="
     "!!." ">=>" ">>=" ">>>" ">>-" ">->" "->>" "-->" "---" "-<<"
     "<~~" "<~>" "<*>" "<||" "<|>" "<$>" "<==" "<=>" "<=<" "<->"
     "<--" "<-<" "<<=" "<<-" "<<<" "<+>" "</>" "###" "#_(" "..<"
     "..." "+++" "/==" "///" "_|_" "www" "&&" "^=" "~~" "~@" "~="
     "~>" "~-" "**" "*>" "*/" "||" "|}" "|]" "|=" "|>" "|-" "{|"
     "[|" "]#" "::" ":=" ":>" ":<" "$>" "==" "=>" "!=" "!!" ">:"
     ">=" ">>" ">-" "-~" "-|" "->" "--" "-<" "<~" "<*" "<|" "<:"
     "<$" "<=" "<>" "<-" "<<" "<+" "</" "#{" "#[" "#:" "#=" "#!"
     "##" "#(" "#?" "#_" "%%" ".=" ".-" ".." ".?" "+>" "++" "?:"
     "?=" "?." "??" ";;" "/*" "/=" "/>" "//" "__" "~~" "(*" "*)"
     "\\\\" "://"))
  ;; Enables ligature checks globally in all buffers. You can also do it
  ;; per mode with `ligature-mode'.
  (global-ligature-mode t))

(use-package solaire-mode :config (solaire-global-mode 1))

(window-divider-mode)

(use-package standard-themes
  :custom
  ;; Read the doc string of each of those user options.  These are some
  ;; sample values.
  (standard-themes-bold-constructs t)
  (standard-themes-italic-constructs t)
  (standard-themes-disable-other-themes t)
  (standard-themes-mixed-fonts t)
  (standard-themes-variable-pitch-ui t)
  (standard-themes-prompts '(extrabold italic))
  ;; more complex alist to set weight, height, and optional
  ;; `variable-pitch' per heading level (t is for any level not
  ;; specified):
  (standard-themes-headings
   '((0 . (variable-pitch light 1.8))
     (1 . (variable-pitch light 1.7))
     (2 . (variable-pitch light 1.6))
     (3 . (variable-pitch semilight 1.5))
     (4 . (variable-pitch semilight 1.4))
     (5 . (variable-pitch 1.3))
     (6 . (variable-pitch 1.2))
     (7 . (variable-pitch 1.1))
     (agenda-date . (1.2))
     (agenda-structure . (variable-pitch light 1.7))
     (t . (variable-pitch 1.0))))
  :config (standard-themes-load-light))

(use-package centaur-tabs
  :after (all-the-icons)
  :custom
  (centaur-tabs-style "bar")
  (centaur-tabs-set-bar 'over)
  (centaur-tabs-cycle-scope 'tabs)
  :config
  (centaur-tabs-group-by-projectile-project)
  (centaur-tabs-change-fonts (face-attribute 'variable-pitch :font) 135)
  (jawadcode/leader-keys
    "t" '(:ignore t :wk "Centaur Tabs")
    "t n" #'centaur-tabs-forward
    "t p" #'centaur-tabs-backward)
  (centaur-tabs-mode t)
  :hook (dashboard-mode . centaur-tabs-local-mode))

(use-package tree-sitter
  :after tree-sitter-langs
  :config
  (require 'tree-sitter-langs)
  (global-tree-sitter-mode)
  (add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode)
  :delight)

(use-package tree-sitter-langs)

(setq org-indent-mode nil)

;; Org-mode keybinds
(jawadcode/leader-keys
  "o"   '(:ignore t :wk "Org")
  "o a" #'org-agenda
  "o e" #'org-export-dispatch
  "o i" #'org-toggle-item
  "o t" #'org-todo
  "o T" #'org-todo-list
  "o g" #'org-babel-tangle
  "o d" #'org-time-stamp)

;; Org mode table keybinds
(jawadcode/leader-keys
  "o b"   '(:ignore t :wk "Tables")
  "o b h" #'org-table-insert-hline)

(use-package toc-org
  :commands toc-org-enable
  :hook (org-mode . toc-org-enable))

(add-hook 'org-mode-hook 'org-indent-mode)
(use-package org-bullets
  :hook (org-mode . org-bullets-mode))

(add-hook 'org-mode-hook #'(lambda () (require 'org-tempo)))

(use-package ivy
  :custom
