emacs/init.org
** Ivy & Counsel

Ivy is a generic completion frontend.
Counsel provides Ivy versions of common Emacs commands.
Ivy-rich adds descriptions alongside commands in M-x.

#+begin_src emacs-lisp
  (use-package ivy
    :custom
    (ivy-use-virtual-buffers t)
    (ivy-count-format "(%d/%d) ")
    (enable-recursive-minibuffers t)
    :config
    (ivy-mode)
    :delight)

  (use-package counsel
    :after ivy
    :config (counsel-mode)
    :delight)

  ;; Adds bling to our ivy completions
  (use-package ivy-rich
    :after ivy
    :custom
    ;; I'll be honest, idk what this does
    (ivy-virtual-abbreviate 'full
                            ivy-rich-switch-buffer-align-virtual-buffer t
                            ivy-rich-path-style 'abbrev)
    :config
    (ivy-set-display-transformer 'ivy-switch-buffer
                                'ivy-rich-switch-buffer-transform)
    (ivy-rich-mode 1))

  (use-package all-the-icons-ivy-rich
    :after ivy-rich
    :config (all-the-icons-ivy-rich-mode 1))
#+end_src

** Company

Company is a completion framework for text-mode.

#+begin_src emacs-lisp
  (use-package company
    :init (setq company-tooltip-align-annotations t)
    :config
    (keymap-set company-active-map "C-n"   nil)
    (keymap-set company-active-map "C-p"   nil)
    (keymap-set company-active-map "RET"   nil)
    (keymap-set company-active-map "M-j"   #'company-select-next)
    (keymap-set company-active-map "M-k"   #'company-select-previous)
    (keymap-set company-active-map "<tab>" #'company-complete-selection)
    (global-company-mode)
    (delight 'company-capf-mode)
    :delight)

(use-package company-box
  :after company
  :hook (company-mode . company-box-mode)
  :delight)
#+end_src

** Yasnippet

#+begin_src emacs-lisp
  (use-package yasnippet
    :hook (prog-mode . yas-minor-mode)
    :delight yas-minor-mode)

  (use-package yasnippet-snippets
    :after (yasnippet))
#+end_src

* Language Support

** LSP-Mode

#+begin_src emacs-lisp
  (use-package lsp-mode
    :custom (lsp-inlay-hint-enable t)
    :commands lsp
    :hook ((prog-mode . lsp)
           (lsp-mode  . lsp-enable-which-key-integration)
           (lsp-mode  . (lambda ()
                          (jawadcode/leader-keys "l" lsp-command-map))))
    :delight flymake-mode)

  (use-package lsp-ui       :commands lsp-ui-mode)
  (use-package lsp-ivy      :commands lsp-ivy-workspace-symbol)
  (use-package lsp-treemacs :commands lsp-treemacs-errors-list)
#+end_src

** C-Mode && C++-Mode

C is for novelty and C++ for testing my mental fortitude.

#+begin_src emacs-lisp
  (defun c-c++-indentation-hook ()
    (setq c-basic-offset tab-width)
    (setq-local evil-shift-width 4))

  (add-hook 'c-mode-hook 'c-c++-indentation-hook)
  (add-hook 'c++-mode-hook 'c-c++-indentation-hook)
#+end_src

** Rust-Mode

Evolve to 🦀.

#+begin_src emacs-lisp
  (use-package rust-mode :commands rust-mode)
#+end_src

** Python-Mode

#+begin_src emacs-lisp
  (use-package lsp-pyright
    :hook (python-mode . (lambda ()
                           (require 'lsp-pyright)
                           (lsp))))  ; or lsp-deferred
#+end_src

** Haskell-Mode

I love me some Zygohistomorphic Prepromorphisms.

#+begin_src emacs-lisp
  (use-package lsp-haskell
    :hook ((haskell-mode          . lsp)
           (haskell-literate-mode . lsp)
           (haskell-mode          . (lambda () (setq-local evil-shift-width 2)))))
#+end_src

** Lean4-Mode

I love lean 💜.

#+begin_src emacs-lisp
  (use-package lean4-mode
    :straight (lean4-mode
               :host github
               :repo "leanprover/lean4-mode"
               :files ("*.el" "data"))
    :commands lean4-mode)
#+end_src

** Idris2-Mode

The simplicity of Coq combined with the usability of Haskell. Currently no
windows support.

#+begin_src emacs-lisp
  (linux-specific!
   (use-package idris2-mode
     :straight (idris2-mode
                :host github
                :repo "idris-community/idris2-mode")
     :commands idris2-mode))
#+end_src

** Meson-Mode

The only usable C/C++ build system.

#+begin_src emacs-lisp
  (use-package meson-mode :commands meson-mode)
#+end_src

** CMake-Mode

Only for working on the projects of other unenlightened people.

#+begin_src emacs-lisp
  (use-package cmake-mode :commands cmake-mode)
#+end_src

** Nix-Mode

I hate this thing, it's like a brain parasite.

#+begin_src emacs-lisp
  (linux-specific!
   (progn
     (use-package lsp-nix
       :straight lsp-mode
       :custom (lsp-nix-nil-formatter ["nixpkgs-fmt"]))

     (use-package nix-mode
       :hook ((nix-mode . lsp-deferred)
              (nix-mode . (lambda ()
                            (setq-local tab-width 2)
                            (setq-local evil-shift-width 2)))))))
#+end_src

** Typescript-Mode

Gotta work on webshit from time to time.

#+begin_src emacs-lisp
  (use-package typescript-mode)
#+end_src

** Svelte-Mode

I refuse to learn React.

#+begin_src emacs-lisp
  (use-package svelte-mode
    :hook ((svelte-mode . lsp)
           ;; Looks worse with ts, css and js isn't highlighted
           (svelte-mode . (lambda () (tree-sitter-hl-mode -1)))))
#+end_src

