emacs/init.el
  (ivy-use-virtual-buffers t)
  (ivy-count-format "(%d/%d) ")
  (enable-recursive-minibuffers t)
  :config
  (ivy-mode)
  :delight)

(use-package counsel
  :after ivy
  :config (counsel-mode)
  :delight)

;; Adds bling to our ivy completions
(use-package ivy-rich
  :after ivy
  :custom
  ;; I'll be honest, idk what this does
  (ivy-virtual-abbreviate 'full
                          ivy-rich-switch-buffer-align-virtual-buffer t
                          ivy-rich-path-style 'abbrev)
  :config
  (ivy-set-display-transformer 'ivy-switch-buffer
                              'ivy-rich-switch-buffer-transform)
  (ivy-rich-mode 1))

(use-package all-the-icons-ivy-rich
  :after ivy-rich
  :config (all-the-icons-ivy-rich-mode 1))

(use-package company
    :init (setq company-tooltip-align-annotations t)
    :config
    (keymap-set company-active-map "C-n"   nil)
    (keymap-set company-active-map "C-p"   nil)
    (keymap-set company-active-map "RET"   nil)
    (keymap-set company-active-map "M-j"   #'company-select-next)
    (keymap-set company-active-map "M-k"   #'company-select-previous)
    (keymap-set company-active-map "<tab>" #'company-complete-selection)
    (global-company-mode)
    (delight 'company-capf-mode)
    :delight)

(use-package company-box
  :after company
  :hook (company-mode . company-box-mode)
  :delight)

(use-package yasnippet
  :hook (prog-mode . yas-minor-mode)
  :delight yas-minor-mode)

(use-package yasnippet-snippets
  :after (yasnippet))

(use-package lsp-mode
  :custom (lsp-inlay-hint-enable t)
  :commands lsp
  :hook ((prog-mode . lsp)
         (lsp-mode  . lsp-enable-which-key-integration)
         (lsp-mode  . (lambda ()
                        (jawadcode/leader-keys "l" lsp-command-map))))
  :delight flymake-mode)

(use-package lsp-ui       :commands lsp-ui-mode)
(use-package lsp-ivy      :commands lsp-ivy-workspace-symbol)
(use-package lsp-treemacs :commands lsp-treemacs-errors-list)

(defun c-c++-indentation-hook ()
  (setq c-basic-offset tab-width)
  (setq-local evil-shift-width 4))

(add-hook 'c-mode-hook 'c-c++-indentation-hook)
(add-hook 'c++-mode-hook 'c-c++-indentation-hook)

(use-package rust-mode :commands rust-mode)

(use-package lsp-pyright
  :hook (python-mode . (lambda ()
                         (require 'lsp-pyright)
                         (lsp))))  ; or lsp-deferred

(use-package lsp-haskell
  :hook ((haskell-mode          . lsp)
         (haskell-literate-mode . lsp)
         (haskell-mode          . (lambda () (setq-local evil-shift-width 2)))))

(use-package lean4-mode
  :straight (lean4-mode
             :host github
             :repo "leanprover/lean4-mode"
             :files ("*.el" "data"))
  :commands lean4-mode)

(linux-specific!
 (use-package idris2-mode
   :straight (idris2-mode
              :host github
              :repo "idris-community/idris2-mode")
   :commands idris2-mode))

(use-package meson-mode :commands meson-mode)

(use-package cmake-mode :commands cmake-mode)

(linux-specific!
 (progn
   (use-package lsp-nix
     :straight lsp-mode
     :custom (lsp-nix-nil-formatter ["nixpkgs-fmt"]))

   (use-package nix-mode
     :hook ((nix-mode . lsp-deferred)
            (nix-mode . (lambda ()
                          (setq-local tab-width 2)
                          (setq-local evil-shift-width 2)))))))

(use-package typescript-mode)

(use-package svelte-mode
  :hook ((svelte-mode . lsp)
         ;; Looks worse with ts, css and js isn't highlighted
         (svelte-mode . (lambda () (tree-sitter-hl-mode -1)))))
