emacs/init.org
** LaTeX-Mode (AUCTeX)

This definitely hasn't taken weeks and weeks of refinement and iteration to
bring to a barely usable state.

#+begin_src emacs-lisp
  (use-package latex
    :straight auctex
    :defer t
    :custom (bibtex-dialect 'biblatex)
    :mode ("\\.tex\\'" . LaTeX-mode)
    :hook (TeX-mode . prettify-symbols-mode)
    :init
    (setq-default TeX-master t)
    (setq TeX-parse-self t
          TeX-auto-save t
          TeX-auto-local ".auctex-auto"
          TeX-style-local ".auctex-style"
          TeX-source-correlate-mode t
          TeX-source-correlate-method 'synctex
          TeX-save-query nil
          TeX-engine 'xetex
          TeX-PDF-mode t)
    :config
    ;; Source: https://tex.stackexchange.com/a/86119/81279
    (setq font-latex-match-reference-keywords
          '(;; BibLaTeX
            ("printbibliography" "[{")
            ("addbibresource" "[{")
            ;; Standard commands.
            ("cite" "[{")
            ("citep" "[{")
            ("citet" "[{")
            ("Cite" "[{")
            ("parencite" "[{")
            ("Parencite" "[{")
            ("footcite" "[{")
            ("footcitetext" "[{")
            ;; Style-specific commands.
            ("textcite" "[{")
            ("Textcite" "[{")
            ("smartcite" "[{")
            ("Smartcite" "[{")
            ("cite*" "[{")
            ("parencite*" "[{")
            ("supercite" "[{")
            ;; Qualified citation lists.
            ("cites" "[{")
            ("Cites" "[{")
            ("parencites" "[{")
            ("Parencites" "[{")
            ("footcites" "[{")
            ("footcitetexts" "[{")
            ("smartcites" "[{")
            ("Smartcites" "[{")
            ("textcites" "[{")
            ("Textcites" "[{")
            ("supercites" "[{")
            ;; Style-independent commands.
            ("autocite" "[{")
            ("Autocite" "[{")
            ("autocite*" "[{")
            ("Autocite*" "[{")
            ("autocites" "[{")
            ("Autocites" "[{")
            ;; Text commands.
            ("citeauthor" "[{")
            ("Citeauthor" "[{")
            ("citetitle" "[{")
            ("citetitle*" "[{")
            ("citeyear" "[{")
            ("citedate" "[{")
            ("citeurl" "[{")
            ;; Special commands.
            ("fullcite" "[{")
            ;; Cleveref.
            ("cref" "{")
            ("Cref" "{")
            ("cpageref" "{")
            ("Cpageref" "{")
            ("cpagerefrange" "{")
            ("Cpagerefrange" "{")
            ("crefrange" "{")
            ("Crefrange" "{")
            ("labelcref" "{")))
    (setq font-latex-match-textual-keywords
          '(;; BibLaTeX
            ("parentext" "{")
            ("brackettext" "{")
            ("hybridblockquote" "[{")
            ;; Auxiliary commands.
            ("textelp" "{")
            ("textelp*" "{")
            ("textins" "{")
            ("textins*" "{")
            ;; Subcaption.
            ("subcaption" "[{")))
    (setq font-latex-match-variable-keywords
          '(;; Amsmath.
            ("numberwithin" "{")
            ;; Enumitem.
            ("setlist" "[{")
            ("setlist*" "[{")
            ("newlist" "{")
            ("renewlist" "{")
            ("setlistdepth" "{")
            ("restartlist" "{")
            ("crefname" "{")))

    (pcase system-type
      ('windows-nt
       (add-to-list 'TeX-view-program-list '("Okular" ("okular --noraise --unique file:%o" (mode-io-correlate "#src:%n%a"))))
       (add-to-list 'TeX-view-program-selection '(output-pdf "Okular")))
      ('gnu/linux
       (add-to-list 'TeX-view-program-selection '(output-pdf "PDF Tools"))
       (add-hook 'TeX-after-compilation-finished-functions #'TeX-revert-document-buffer)))

    (add-hook 'tex-mode-local-vars-hook #'lsp)
    (add-hook 'latex-mode-local-vars-hook #'lsp)

    (require 'tex-fold)
    (add-hook 'LaTeX-mode-hook #'TeX-fold-mode)
    (require 'preview)
    (add-hook 'LaTeX-mode-hook #'LaTeX-preview-setup))

  (use-package auctex-latexmk
    :after latex
    :hook (LaTeX-mode . (lambda () (setq TeX-command-default "LatexMk")))
    :init (setq auctex-latexmk-inherit-TeX-PDF-mode t)
    :config (auctex-latexmk-setup))
  (use-package evil-tex
    :after latex
    :hook (LaTeX-mode . evil-tex-mode))
  (use-package cdlatex
    :after latex
    :hook ((LaTeX-mode . cdlatex-mode)
           (org-mode   . org-cdlatex-mode))
    :config (setq cdlatex-use-dollar-to-ensure-math nil))

  (use-package company-auctex
    :after latex
    :config (company-auctex-init))

  (use-package company-reftex
    :after latex
    :config
    (add-hook 'TeX-mode-hook
              #'(lambda ()
                 (setq-local company-backends
                             (append
                              '(company-reftex-labels company-reftex-citations)
                              company-backends)))))

  (use-package company-math
    :after latex
    :config
    (add-hook 'TeX-mode-hook
              #'(lambda ()
                 (setq-local company-backends
                             (append
                              '(company-math-symbols-latex company-math-symbols-unicode company-latex-commands)
                              company-backends)))))
#+end_src

